tutorials/multiphase/vof/vofSolver/laminar/fallingDrop/0.org/U
/*---------------------------------------------------------------------------*\
Caelus 10.04
Web:      www.caelus-cml.com 
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    atmosphere
    {
        type            pressureInletOutletVelocity;
        value           uniform (0 0 0);
    }
    
    front
    {
        type            symmetryPlane;
    }
    
    back
    {
        type            symmetryPlane;
    }
    
    defaultFaces
    {
        type            symmetryPlane;
    }
}
