tutorials/multiphase/vof/vofSolver/laminar/fallingDrop/0.org/p_rgh
/*---------------------------------------------------------------------------*\
Caelus 10.04
Web:      www.caelus-cml.com 
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 1e5;

boundaryField
{
    atmosphere
    {
        type            fixedValue;
        value           uniform 1e5;
    }
    
    front
    {
        type            symmetryPlane;
    }
    
    back
    {
        type            symmetryPlane;
    }
    
    defaultFaces
    {
        type            empty;
    }
}
