tutorials/multiphase/vof/vofSolver/laminar/fallingDrop/0.org/alpha1
/*---------------------------------------------------------------------------*\
Caelus 10.04
Web:      www.caelus-cml.com 
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      alpha1;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0.0;

boundaryField
{
    atmosphere
    {
        type            inletOutlet;
        inletValue      uniform 0.0;
        value           uniform 0.0;
    }
        
    front
    {
        type            symmetryPlane;
    }
    
    back
    {
        type            symmetryPlane;
    }
    
    defaultFaces
    {
        type            symmetryPlane;
    }
}
